Revit 2027 API
EvaluatedParameter.AsValueString(Document) Method
 Get the parameter value as a string with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AsValueString(
	Document doc
)
Public Function AsValueString (
	doc As Document
) As String
public:
String^ AsValueString(
	Document^ doc
)
member AsValueString :
        doc : Document -> string
Parameters
doc Document
 The document to be used to obtain information about the parameter.
Return Value
String
 The string that represents the parameter value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EvaluatedParameter Class
AsValueString Overload
Autodesk.Revit.DB Namespace